MMBytes/MultiGeiger-V2/sdkconfig.defaults.heltec_v2
# ============================================================================
# Heltec WiFi Kit 32 V2 overlay — ESP32-D0WDQ6, 8 MB flash, no PSRAM, CP2102.
# ============================================================================

CONFIG_IDF_TARGET="esp32"

# Auto-detect XTAL — Heltec V2 modules may be 26 MHz (arduino-esp32 default is AUTO).
# Hardcoding 40 MHz here produced garbled UART (~177 kbaud actual at 115200 nominal).
CONFIG_XTAL_FREQ_AUTO=y

# 8 MB flash on Heltec V2.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# V2.4.5: mbedTLS dynamic buffer. Default (off) pre-allocates the full
# CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN (16 KB) + SSL_OUT_CONTENT_LEN (4 KB)
# = 20 KB per active TLS context AND keeps the big handshake scratch
# (~16 KB more) alive for the lifetime of the mbedtls_ssl_context.
# With dynamic-buffer on, mbedTLS only allocates the IN/OUT record
# buffers as needed and frees the handshake scratch once the handshake
# completes. Heltec V2 (140 KB free heap, 5.6 KB lifetime min during
# TLS handshake) gets ~15-20 KB of transient headroom back; FeatherS3-D
# / QT Py have abundant PSRAM heap and don't enable this (per-record
# alloc/free CPU overhead not worth paying when the heap isn't tight).
# Conservative enable: the DYNAMIC_FREE_CONFIG_DATA / DYNAMIC_FREE_CA_CERT
# sub-options that interact with the cert bundle are intentionally left off.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
# CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA is not set
# CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT is not set
